app/controllers/listings_controller.rb

SELECT "missions".* FROM "missions" WHERE "missions"."listing_id" = ? LIMIT ?  [["listing_id", 1], ["LIMIT", 1]]
---
  def show
    @mission = Mission.find_by(listing_id: params[:id])