app/controllers/listings_controller.rb

SELECT "bookings".* FROM "bookings"
INSERT INTO "missions" ("mission_type", "date", "price", "listing_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["mission_type", "last_checkout"], ["date", "2016-10-15"], ["price", 20], ["listing_id", 1], ["created_at", "2023-06-22 13:15:46.727571"], ["updated_at", "2023-06-22 13:15:46.727571"]]
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "missions".* FROM "missions" WHERE "missions"."listing_id" = ? AND "missions"."mission_type" = ? AND "missions"."date" = ? AND "missions"."price" = ? LIMIT ?  [["listing_id", 1], ["mission_type", "first_checkin"], ["date", "2016-10-10"], ["price", 20], ["LIMIT", 1]]
INSERT INTO "missions" ("mission_type", "date", "price", "listing_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["mission_type", "checkout_checkin"], ["date", "2016-10-15"], ["price", 20], ["listing_id", 1], ["created_at", "2023-06-22 13:46:40.668548"], ["updated_at", "2023-06-22 13:46:40.668548"]]
SELECT "missions".* FROM "missions" WHERE "missions"."listing_id" = ? AND "missions"."mission_type" = ? AND "missions"."date" = ? AND "missions"."price" = ? LIMIT ?  [["listing_id", 1], ["mission_type", "checkout_checkin"], ["date", "2016-10-15"], ["price", 20], ["LIMIT", 1]]
SELECT "missions".* FROM "missions"
SELECT "reservations".* FROM "reservations" WHERE "reservations"."listing_id" = ? ORDER BY "reservations"."id" ASC LIMIT ?  [["listing_id", 1], ["LIMIT", 1]]
SELECT "missions".* FROM "missions" WHERE "missions"."listing_id" = ? AND "missions"."mission_type" = ? AND "missions"."date" = ? AND "missions"."price" = ? LIMIT ?  [["listing_id", 1], ["mission_type", "checkout_checkin"], ["date", "2016-10-13"], ["price", 20], ["LIMIT", 1]]
---
  def generate_mission
    bookings = Booking.all
    bookings.each do |booking|
      Mission.find_or_create_by!(listing_id: booking.listing_id, mission_type: 'first_checkin', date: booking.start_date, price: 10 * booking.listing.num_rooms)
      Mission.find_or_create_by!(listing_id: booking.listing_id, mission_type: 'last_checkout', date: booking.end_date, price: 5 * booking.listing.num_rooms)
      unless booking.listing.reservations.first.end_date == booking.end_date
        Mission.find_or_create_by!(listing_id: booking.listing_id, mission_type: 'checkout_checkin', date: booking.listing.reservations.first.end_date, price: 10 * booking.listing.num_rooms)

SELECT "missions".* FROM "missions"
---
  def missions_for_json
    missions = Mission.all
    {
      missions: [
        missions.map do |mission|
          { listing_id: mission.listing_id, mission_type: mission.mission_type, date: mission.date, price: mission.price }
        end
      ]